<template>
     <div>
            <h1>客户端子系统（学生版）</h1>
            <ol>
                <li>课程选择</li>
                <p>学生登录到选课系统可以得到课程列表，列表中每行有课程名称，发布教师，所属院系，课题容量。点击课程名称可以得到相关课程的详细信息以及具体要求。</p>
                <li>课表确认</li>
                <p>学生选择好相关课程之后可以在查看已选课程，以及进行退选课程，确认初始课表后提交</p>
                <li>退补选课</li>
                <p>选课至截止日期后一段时间，选课系统经历课程管理（比如取消某些课程、增加某些课程课容量），会发出公告，然后学生查看个人课表，可以再次补选课程。</p>
                <li>课表查看</li>
                <p>学生在系统筛选以后，可以得到自己的最终课表，并进行查看。</p>
            </ol>
        </div>
</template>
<script>
export default {
    
}
</script>
<style>

</style>
