<template>
  <div>

      
            <h1>客户端子系统</h1>
            <p>学生通过学校的排课网站登录到系统中进行排课，学生通过它提交课表，进行排课，这就是客户端子系统的功能。在客户端用户可以看到课表名称，课表发布日期，截止日期，课表类型，课程人数等说明，按课表发布日期排序。当点击课表名称时进入课表详细信息页面，如果排课的话，可以填写课表信息，并生成课表，最后将课表连同课表一同提交。</p>

                <ol>
                    <li>课表选择</li>
                    <p>学生登录到排课网站可以看到排课的课表列表，在课表列表课表名称，课表发布日期，截止日期，课表类型，排课人数等，按课表发布日期序。当点击某个排课课表名称时进入该课表详细信息页面，课表详细页面显示课表名称，课表描述，课表要求，排课人数等。
                    </p>

                    <li>课表输入</li>
                    <p>如果学生满意某个课表，就开始录入课表，课表从学生的基本信息开始，然后输入基本信息、专业信息等内容，最后开始生成课表。</p>

                    <li>课表生成</li>
                    <p>学生在输入课表后必须生成课表、课表从总课表中随机抽取，学校人力资源人员通过课表的生成情况和课表情况来选择学生。</p>

                </ol>
        </div>
</template>


<script>
export default {
    
}
</script>
<style>

</style>
