<template>
    <div>
            <h1>管理端子系统</h1>
            <ol>
                <li>登录管理</li>
                <p>登录管理负责所有的选课管理端的登录，管理端的人员要登录到管理端必须经过登录界面，输入自己的用户名和密码，然后系统判断这个用户的权限信息，不同账号可能拥有不同的权限，系统根据不同的权限实现不同的功能。
                </p>
                <li>课程管理</li>
                <p>选课管理由管理员登录到系统，实现课程快速查询、课程修改的功能及提供课程课表的详细信息。</p>
                <li>选课管理</li>
                <p>选课根据学生所属专业，年级，以及选课优先顺序把课程分配给学生，同时保证不发生课程冲突，最后形成课表。</p>
                <li>课程筛选</li>
                <p>学生选课到截止时间后，系统开始收集所有课程信息，尤其是人数，人数过少，取消该课程；人数过多，追加该课程。</p>
                <li>用户管理</li>
                <p>用户管理是由系统管理员增加或删除用户，编辑账号、用户密码，修改用户权限，使具有不同权限的用户进入系统主界面时，出现在界面的操作按钮有所不同，具体的操作按钮与用户所具有的权限对应。</p>

            </ol>
        </div>
</template>
<script>
export default {
    
}
</script>
<style>

</style>
