<template>
  <div>
    <h1>管理端子系统</h1>
    <ol>
      <li>登录管理</li>
      <p>登录管理负责所有的管理端的登录，管理端的人员要登录到管理端必须经过登录界面，输入自己的用户名和密码，然后系统判断这个用户的权限信息，不同的登录人可能具有不同的权限，系统根据不同的权限实现不同的功能。</p>
      <li>管理课表</li>
      <p>课表管理由管理员登录到系统，实现课程课表的增加、删除、修改的功能及提供课程课表的详细信息。</p>
      <li>课表发布</li>
      <p>课表发布是由管理员登录到系统，录入课表及课表的详细描述信息，并且为课表附加课表，同时也可对课表进行增加、删除、修改的功能。</p>
      <li>课表管理</li>
      <p>课表管理是由教学管理部的管理人员对学生发来的课表进行整理，并根据课表的份数，安排合适的课表，同时浏览课表的基本信息，最后确定可以进行课表的人员，这样将所有的学生人为等待课表、课表删除、保存课表三个状态。</p>
      <li>整理课表</li>
      <p>课表管理是由人力资源管理部门的课表管理者通知要试的人员具体课表的时间、然后以人员进行课表，记录课表结果。</p>
      <li>用户管理</li>
      <p>用户管理是由系统管理员增加或删除用户，编辑用户名、用户密码，修改用户权限，使具有不同权限的用户进入系统主界面时，出现在界面左侧栏中的图标数有所不同，具体的图标与用户所具有的权限对应。</p>
    </ol>
  </div>
</template>
<script>
export default {
    
}
</script>
<style>

</style>

