<template>
     <div>
            <h1>管理端系统</h1>
            <ol>
                <li>登录管理</li>
                <p>登陆管理需要管理毕业设计管理端子系统的所有登录，毕业设计负责人需要用分发好的账号在登录界面输入自己的账号和密码登录系统，不同账号可能拥有不同的权限，系统会根据不同的账号给予不同权限</p>
                <li>课题管理</li>
                <p>毕业设计管理用于在后台添加、删除、修改、审核老师所提交的毕业设计以及查询老师所提交毕业设计和与毕业设计有关的信息</p>
                <li>选题管理</li>
                <p>毕业设计分配用于根据学生优先级以及所选毕业设计的老师进行的学生选择来分配调剂毕业设计，以保证毕业设计与学生是一对一的关系，也保证毕业设计不会被先选者抢得</p>
                <li>课题发布</li>
                <p>毕业设计的发布是由毕业设计负责人登陆系统，直接发布毕业设计题目</p>
                <li>用户管理</li>
                <p>用户管理是由系统管理员增加或删除用户，编辑账号、用户密码，修改用户权限，使具有不同权限的用户进入系统主界面时，出现在界面的操作按钮有所不同，具体的操作按钮与用户所具有的权限对应</p>
                <li>成绩管理</li>
                <p>成绩管理用于修改、查询毕业设计所对应的学生的最终毕业设计分数</p>
                <li>文档管理</li>
                <P>文档管理用于查询学生提交的毕业设计文档</P>
            </ol>
        </div>
</template>
<script>
export default {
    
}
</script>

