<template>
     <div>
            <h1>客户端子系统（学生端）</h1>
            <ol>
                <li>课题选择</li>
                <p>学生登录到毕业设计系统可以看到课题列表，在课题列表中有课题题目，发布教师，所属院系，课题容量，按照所属院系以及发布教师排序。点击课题题目可以现实相关课题的详细信息以及具体要求。</p>
                <li>课题确认</li>
                <p>学生选择相关课题之后可以在查看已选课题，或者进行课题退选，可以确认最终课题。</p>
                <li>课题提交</li>
                <p>在确定好最终课题之后，学生可以查看最终课题及具体要求，并在规定日期内提交毕业设计。</p>
                <li>成绩确认</li>
                <p>学生可以在成绩公布以后查看自己的成绩，并进行成绩确认。</p>
            </ol>
        </div>
</template>
<script>
export default {
    
}
</script>

