<template>
     <div>
            <h1>后台管理子系统</h1>
            <p>后台管理子系统是教务管理系统的一部分，负责维护所有学生、教师、教室、课程信息。同时管理教务管理系统不同类型的用户账号，进行权限维护。</p>
            <ol>
                <li>登录管理</li>
                <p>登录管理是负责所有的管理端的登录，管理端的人员要登录到管理端必须经过登录界面，输入自己的用户名和密码，通过判断这个用户的权限信息，不同的登录人可能具有不同的权限，根据不同的权限现实不同的功能。</p>
                <li>信息查询</li>
                <p>信息查询通过调用其他子系统提供的界面，查询各类报表。</p>
                <li>课程管理</li>
                <p>课程管理用例是管理员登录到系统，对课程信息的增、删、改的功能。</p>
                <li>教室管理</li>
                <p>教室管理用例是管理员登录到系统，对教室信息的增、删、改的功能。</p>
                <li>选课信息</li>
                <p>选课信息用例是管理员调用选课子系统提供的查询界面，查询到的每门课的选课情况。</p>
                <li>成绩信息</li>
                <p>成绩信息用例是管理员调用成绩管理子系统提供的查询界面，查询到的学生成绩情况。</p>
                <li>毕设信息</li>
                <p>毕设信息用例是管理员调用毕业设计管理子系统提供的查询界面，查询毕业设计选题情况和学生成绩。</p>

            </ol>
        </div>
</template>
<script>
export default {
    
}
</script>
