<template>
  <div>
    <h1>成绩管理子系统</h1>
    <p>本子项目是为学校开发的一个成绩管理系统，提供了上传、查询、修改学生成绩的功能。为满足学校的需求，方便对学生成绩进行管理，设置了三种不同的参与者：客户端的教师、学生和管理端的教务管理人员，并为他们设置了不同的权限。</p>
     <div>
            <h2>管理端管理子系统</h2>
            <ol>
                <li>学期选择</li>
                <p>学生登陆到成绩管理网站可以看到每个学年的每个学期列表，每个学期列表有最后的成绩更新时间，以及信息反馈截止时间。</p>
                <li>确认成绩</li>
                <p>学生在选择完自己要查看的学期之后，会出现各个科目的名称，gpa，分数，以及科目的通过与否情况。</p>
                <li>反馈信息</li>
                <p>学生查看完所有成绩，如果对自己的某个科目成绩有疑问，在反馈截止日期前可以通过点击这个选项反馈信息到系统中，由管理人员管理。</p>
              
            </ol>
        </div>
        <div>
                <h2>管理端管理子系统</h2>
                <ol>
                    <li>统计每门课成绩情况描述</li>
                    <p>  该功能是管理员在登陆系统的情况下，对于学生每门课成绩情况的查询及获得各类报表。 </p>
                    
                </ol>
            </div>
  </div>
</template>
